In [8]:
#ฝึก Pandas library

In [9]:
import tensorflow as tf
import pandas as pd
import numpy as np

In [10]:
df= pd.read_csv('//Users/noppanut/Desktop/Python_Deep_Learning/Example4.csv',index_col=0)
df

    a   b   c   d
0   1   2   3   4
1   4   5   5   6
2   7   8   9  10
3  11  12  13  14

In [11]:
pd.read_excel('/Users/noppanut/Desktop/Python_Deep_Learning/Example4.xlsx',sheet_name='sheet1')

   Unnamed: 0   a   b   c   d
0           0   1   2   3   4
1           1   4   5   5   6
2           2   7   8   9  10
3           3  11  12  13  14

In [12]:
df = pd.read_excel('/Users/noppanut/Desktop/Python_Deep_Learning/Example4.xlsx',sheet_name='sheet1',index_col=0)
df

    a   b   c   d
0   1   2   3   4
1   4   5   5   6
2   7   8   9  10
3  11  12  13  14

In [13]:
pd.read_csv('/Users/noppanut/Desktop/Python_Deep_Learning/Example4.txt',sep='\t',lineterminator='\r',index_col=0)

    a   b   c   d
0   1   2   3   4
1   4   5   5   6
2   7   8   9  10
3  11  12  13  14

In [14]:
df = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')
df[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
1,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
2,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
3,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
4,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"
...,...,...,...,...,...,...
555,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
556,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
557,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
558,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
559,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [15]:
#การ Selecting Data Frame

In [16]:
df= pd.read_csv('//Users/noppanut/Desktop/Python_Deep_Learning/Example4.csv',index_col=0)
df

    a   b   c   d
0   1   2   3   4
1   4   5   5   6
2   7   8   9  10
3  11  12  13  14

In [17]:
new_df = df.loc[:,['a','b','c']] #selec colum
new_df

    a   b   c
0   1   2   3
1   4   5   5
2   7   8   9
3  11  12  13

In [18]:
new_df = df.loc[[0,1,3],:] #selec row
new_df

    a   b   c   d
0   1   2   3   4
1   4   5   5   6
3  11  12  13  14

In [19]:
new_df = df.loc[[0,1,3],['a','c'],] #selec row & colum
new_df

    a   c
0   1   3
1   4   5
3  11  13

In [20]:
new_df = df.loc[:,'b':'d'] #selec row & colum
new_df

    b   c   d
0   2   3   4
1   5   5   6
2   8   9  10
3  12  13  14

In [21]:
df2 = pd.read_csv('//Users/noppanut/Desktop/Python_Deep_Learning/Example5.csv',index_col=0)
df2

    a   b   c   d
w   1   2   3   4
x   4   5   5   6
y   7   8   9  10
z  11  12  13  14

In [22]:
new_df2 = df2.loc['x':,'b':]
new_df2

    b   c   d
x   5   5   6
y   8   9  10
z  12  13  14

In [23]:
df

    a   b   c   d
0   1   2   3   4
1   4   5   5   6
2   7   8   9  10
3  11  12  13  14

In [24]:
new_df = df.iloc[[1,3,2],:]
new_df

    a   b   c   d
1   4   5   5   6
3  11  12  13  14
2   7   8   9  10

In [25]:
new_df = df.iloc[[1,3],1:3]
new_df

    b   c
1   5   5
3  12  13

In [26]:
#operator

In [27]:
new_df= pd.read_csv('//Users/noppanut/Desktop/Python_Deep_Learning/Example4.csv',index_col=0)
new_df

    a   b   c   d
0   1   2   3   4
1   4   5   5   6
2   7   8   9  10
3  11  12  13  14

In [28]:
new_df = df[['a','b','c']]
new_df

    a   b   c
0   1   2   3
1   4   5   5
2   7   8   9
3  11  12  13

In [29]:
#boolean selection

In [30]:
df

    a   b   c   d
0   1   2   3   4
1   4   5   5   6
2   7   8   9  10
3  11  12  13  14

In [31]:
df['a']>4

0    False
1    False
2     True
3     True
Name: a, dtype: bool

In [32]:
new_df2 = df[df['a']>4]
new_df2

    a   b   c   d
2   7   8   9  10
3  11  12  13  14

In [33]:
new_df2 = df[(df['a']>4) & (df['c']==13)]
new_df2

    a   b   c   d
3  11  12  13  14

In [35]:
def x2(x):
    return x*2

In [36]:
new_df = df[(df['a']>4)].apply(x2)
new_df

    a   b   c   d
2  14  16  18  20
3  22  24  26  28

In [41]:
new_df = df[['b']].apply(x2)
new_df

    b
0   4
1  10
2  16
3  24